<?php

return [


    'insert' => 'تمت عملية الاضافة بنجاح',
    'update' => 'تم حفظ التعديلات بنجاح',
    'delete' => 'تمت عملية الحذف بنجاح',
    'certify' => 'تم اعتماد السجل بنجاح',
    'activate' => 'تم التفعيل بنجاح',
    'deactivate' => 'تم الغاء التفعيل',
    'import' => 'تم استيراد البيانات بنجاح',
    'missed_object' => 'العنصر مطلوب غير موجود',
    "delete_hospital_failure" => "لا يمكن حذف هذه المستشفى لارتباطها بعمليات جراحية",
    "delete_wounded_failure" => "لا يمكن حذف هذا المريض لارتباطه بعمليات جراحية",
    "delete_page_failure" => "لا يمكن حذف هذا الرابط لارتباطه بعناصر أخرى",
    "delete_country_failure" => "لا يمكن حذف هذه الدولة  لارتباطها بعناصر أخرى",
    "delete_branch_failure" => "لا يمكن حذف لارتباطه بالموظفين يجب تحويل الموظفين لفرع آخر قبل الحذف",
    "close_task_failure" => "يجب اغلاق جميع المهام الفرعية أولا",
    "close_task_success" => "تم اغلاق المهمة بنجاح",
    "delete_role_failure"=>"لا يمكن حذف الدور لارتباطه بالمستخدمين",
    "password_success"=>"تم تغيير كلمة المرور بنجاح",
    "delete_department_failure"=>"لا يمكن حذف القسم لارتباطه بالموظفين",
    "permissions_denies"=>"لا تمتلك الصلاحية اللازمة لتنفيذ المهمة",
    "delete"=>[
        "success"=>"تمت عملية الحذف بنجاح",
        "failure"=>[
            "certify"=>"لا يمكن حذف سجل معتمد",
        ]
    ]

];
